Revit 2027 API
TableViewUIUtils Class
 This utility class contains members that involve the Revit UI and operate on schedule views or MEP electrical panel schedules.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.TableViewUIUtils
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class TableViewUIUtils
Public NotInheritable Class TableViewUIUtils
public ref class TableViewUIUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type TableViewUIUtils = class end
The TableViewUIUtils type exposes the following members.
Methods
Name | Description
TestCellAndPromptToEditTypeParameter |  Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited.
Top
See Also
Reference
Autodesk.Revit.UI Namespace